## Pandas Task - 3

In [1]:
import pandas as pd

In [2]:
import warnings 
warnings.filterwarnings('ignore')

In [3]:
df=pd.read_csv("uncleaned_customers (1).csv")
df

,CustomerID,Name,Age,Gender,PurchaseAmount,PurchaseDate,City,Membership
0,101,Steve,58.0,F,374.05,2024-01-01,Los Angeles,Gold
1,102,Sophia,44.0,F,186.92,2024-01-02,New York,Gold
2,103,Linda,28.0,M,159.51,2024-01-03,NaN,Gold
3,104,Emma,58.0,M,224.81,2024-01-04,Miami,NaN
4,105,Karen,45.0,F,106.81,2024-01-05,Miami,Bronze
...,...,...,...,...,...,...,...,...
995,1096,Susan,51.0,M,337.99,2026-09-22,Houston,Bronze
996,1097,Emma,59.0,F,222.91,2026-09-23,Houston,Gold
997,1098,Steve,22.0,M,NaN,2026-09-24,Miami,Bronze
998,1099,John,34.0,M,379.03,2026-09-25,Chicago,Gold
999,1100,Daniel,40.0,M,175.31,2026-09-26,New York,Gold

In [4]:
#Access the Name column as a Series.

print("Columns in dataset:")
print(df.columns.tolist())


if "Name" in df.columns:
    name_series = df["Name"]
    print("\nType of extracted object:")
    print(type(name_series))
    
    print("\nData type of the Series:")
    print(name_series.dtype)
    
    print("\nFirst 5 values:")
    print(name_series.head())
else:
    print("\nColumn 'Name' not found.")

Columns in dataset:
['CustomerID', 'Name', 'Age', 'Gender', 'PurchaseAmount', 'PurchaseDate', 'City', 'Membership']

Type of extracted object:
<class 'pandas.core.series.Series'>

Data type of the Series:
object

First 5 values:
0     Steve
1    Sophia
2     Linda
3      Emma
4     Karen
Name: Name, dtype: object

In [5]:
#Select multiple columns: Name and PurchaseAmount.
selected_columns = df[["Name", "PurchaseAmount"]]

print("Type of selected object:")
print(type(selected_columns))

print("\nFirst 5 rows:")
print(selected_columns.head())

Type of selected object:
<class 'pandas.core.frame.DataFrame'>

First 5 rows:
     Name  PurchaseAmount
0   Steve          374.05
1  Sophia          186.92
2   Linda          159.51
3    Emma          224.81
4   Karen          106.81

In [6]:
#Access the first 5 rows of the DataFrame.
first_five = df.head()

print("First 5 rows of the DataFrame:\n")
print(first_five)

print("\nShape of this subset:", first_five.shape)

First 5 rows of the DataFrame:

   CustomerID    Name   Age Gender  PurchaseAmount PurchaseDate         City  \
0         101   Steve  58.0      F          374.05   2024-01-01  Los Angeles
1         102  Sophia  44.0      F          186.92   2024-01-02     New York
2         103   Linda  28.0      M          159.51   2024-01-03          NaN
3         104    Emma  58.0      M          224.81   2024-01-04        Miami
4         105   Karen  45.0      F          106.81   2024-01-05        Miami

  Membership
0       Gold
1       Gold
2       Gold
3        NaN
4     Bronze

Shape of this subset: (5, 8)

In [7]:
#Retrieve the row with CustomerID = 105.
row_105 = df[df["CustomerID"] == 105]

print("Row with CustomerID = 105:\n")
print(row_105)

print("\nType of result:", type(row_105))
print("Shape:", row_105.shape)

Row with CustomerID = 105:

   CustomerID   Name   Age Gender  PurchaseAmount PurchaseDate   City  \
4         105  Karen  45.0      F          106.81   2024-01-05  Miami

  Membership
4     Bronze

Type of result: <class 'pandas.core.frame.DataFrame'>
Shape: (1, 8)

In [8]:
#Get all customers where Age > 30.
customers_over_30 = df[df["Age"] > 30]

print("Customers where Age > 30:\n")
print(customers_over_30.head())

print("\nTotal customers with Age > 30:", customers_over_30.shape[0])

Customers where Age > 30:

   CustomerID    Name   Age Gender  PurchaseAmount PurchaseDate         City  \
0         101   Steve  58.0      F          374.05   2024-01-01  Los Angeles
1         102  Sophia  44.0      F          186.92   2024-01-02     New York
3         104    Emma  58.0      M          224.81   2024-01-04        Miami
4         105   Karen  45.0      F          106.81   2024-01-05        Miami
5         106    John  47.0      M          419.95   2024-01-06  Los Angeles

  Membership
0       Gold
1       Gold
3        NaN
4     Bronze
5     Silver

Total customers with Age > 30: 629

In [10]:
#Find all purchases where PurchaseAmount > 250
high_purchases = df[df["PurchaseAmount"] > 250]

print("Purchases where PurchaseAmount > 250:\n")
print(high_purchases.head())

print("\nTotal purchases above 250:", high_purchases.shape[0])

Purchases where PurchaseAmount > 250:

   CustomerID    Name   Age Gender  PurchaseAmount PurchaseDate         City  \
0         101   Steve  58.0      F          374.05   2024-01-01  Los Angeles
5         106    John  47.0      M          419.95   2024-01-06  Los Angeles
7         108    Emma  44.0      F          377.25   2024-01-08      Houston
8         109   David  39.0      M          413.37   2024-01-09        Miami
9         110  Daniel  58.0      M          311.32   2024-01-10      Houston

  Membership
0       Gold
5     Silver
7       Gold
8     Silver
9     Silver

Total purchases above 250: 561

In [11]:
#Select all rows where Gender is 'F' and City is 'Los Angeles'.

filtered_data = df[(df["Gender"] == "F") & (df["City"] == "Los Angeles")]

print("Rows where Gender is 'F' and City is 'Los Angeles':\n")
print(filtered_data.head())

print("\nTotal matching rows:", filtered_data.shape[0])

Rows where Gender is 'F' and City is 'Los Angeles':

    CustomerID    Name   Age Gender  PurchaseAmount PurchaseDate         City  \
0          101   Steve  58.0      F          374.05   2024-01-01  Los Angeles
23         124  Sophia  25.0      F          252.61   2024-01-24  Los Angeles
24         125    John  56.0      F          115.78   2024-01-25  Los Angeles
26         127  Daniel  33.0      F          393.07   2024-01-27  Los Angeles
27         128   Steve  37.0      F          142.59   2024-01-28  Los Angeles

   Membership
0        Gold
23        NaN
24     Bronze
26       Gold
27     Bronze

Total matching rows: 71

In [12]:
#Get all customers who have Gold membership.
gold_customers = df[df["Membership"] == "Gold"]

print("Customers with Gold membership:\n")
print(gold_customers.head())

print("\nTotal Gold members:", gold_customers.shape[0])

Customers with Gold membership:

   CustomerID    Name   Age Gender  PurchaseAmount PurchaseDate         City  \
0         101   Steve  58.0      F          374.05   2024-01-01  Los Angeles
1         102  Sophia  44.0      F          186.92   2024-01-02     New York
2         103   Linda  28.0      M          159.51   2024-01-03          NaN
6         107   Karen  30.0      M          143.86   2024-01-07     New York
7         108    Emma  44.0      F          377.25   2024-01-08      Houston

  Membership
0       Gold
1       Gold
2       Gold
6       Gold
7       Gold

Total Gold members: 224

In [13]:
#Find customers whose PurchaseAmount is missing (NaN).

missing_purchase = df[df["PurchaseAmount"].isna()]

print("Customers with missing PurchaseAmount:\n")
print(missing_purchase.head())

print("\nTotal customers with missing PurchaseAmount:", missing_purchase.shape[0])

Customers with missing PurchaseAmount:

    CustomerID   Name   Age Gender  PurchaseAmount PurchaseDate         City  \
18         119   Mary   NaN      M             NaN   2024-01-19     New York
40         141  Karen  47.0      M             NaN   2024-02-10      Chicago
61         162   John  40.0      M             NaN   2024-03-02  Los Angeles
69         170    NaN  53.0      M             NaN   2024-03-10      Chicago
71         172  Karen   NaN      M             NaN   2024-03-12      Houston

   Membership
18       Gold
40       Gold
61     Bronze
69     Bronze
71     Bronze

Total customers with missing PurchaseAmount: 109

In [14]:
#Show all customers whose City is missing.
missing_city = df[df["City"].isna()]

print("Customers with missing City:\n")
print(missing_city.head())

print("\nTotal customers with missing City:", missing_city.shape[0])

Customers with missing City:

    CustomerID    Name   Age Gender  PurchaseAmount PurchaseDate City  \
2          103   Linda  28.0      M          159.51   2024-01-03  NaN
10         111     Tom  36.0      M          281.61   2024-01-11  NaN
11         112   Linda  20.0      F          193.35   2024-01-12  NaN
14         115   Karen  53.0      M          257.20   2024-01-15  NaN
20         121  Daniel  41.0      M          192.50   2024-01-21  NaN

   Membership
2        Gold
10     Bronze
11        NaN
14        NaN
20     Bronze

Total customers with missing City: 164

In [15]:
#Get all customers who are Male AND Age > 30.

male_over_30 = df[(df["Gender"] == "M") & (df["Age"] > 30)]

print("Male customers with Age > 30:\n")
print(male_over_30.head())

print("\nTotal Male customers with Age > 30:", male_over_30.shape[0])

Male customers with Age > 30:

    CustomerID    Name   Age Gender  PurchaseAmount PurchaseDate         City  \
3          104    Emma  58.0      M          224.81   2024-01-04        Miami
5          106    John  47.0      M          419.95   2024-01-06  Los Angeles
8          109   David  39.0      M          413.37   2024-01-09        Miami
9          110  Daniel  58.0      M          311.32   2024-01-10      Houston
10         111     Tom  36.0      M          281.61   2024-01-11          NaN

   Membership
3         NaN
5      Silver
8      Silver
9      Silver
10     Bronze

Total Male customers with Age > 30: 328

In [16]:
#Find customers who are Female OR have a PurchaseAmount > 300.

filtered_customers = df[(df["Gender"] == "F") | (df["PurchaseAmount"] > 300)]

print("Customers who are Female OR PurchaseAmount > 300:\n")
print(filtered_customers.head())

print("\nTotal matching customers:", filtered_customers.shape[0])

Customers who are Female OR PurchaseAmount > 300:

   CustomerID    Name   Age Gender  PurchaseAmount PurchaseDate         City  \
0         101   Steve  58.0      F          374.05   2024-01-01  Los Angeles
1         102  Sophia  44.0      F          186.92   2024-01-02     New York
4         105   Karen  45.0      F          106.81   2024-01-05        Miami
5         106    John  47.0      M          419.95   2024-01-06  Los Angeles
7         108    Emma  44.0      F          377.25   2024-01-08      Houston

  Membership
0       Gold
1       Gold
4     Bronze
5     Silver
7       Gold

Total matching customers: 707

In [17]:
#Select rows where Age is between 30 and 40 (inclusive).

age_30_40 = df[df["Age"].between(30, 40, inclusive="both")]

print("Customers with Age between 30 and 40 (inclusive):\n")
print(age_30_40.head())

print("\nTotal customers aged 30–40:", age_30_40.shape[0])

Customers with Age between 30 and 40 (inclusive):

    CustomerID   Name   Age Gender  PurchaseAmount PurchaseDate      City  \
6          107  Karen  30.0      M          143.86   2024-01-07  New York
8          109  David  39.0      M          413.37   2024-01-09     Miami
10         111    Tom  36.0      M          281.61   2024-01-11       NaN
19         120  David  37.0      F          436.94   2024-01-20   Chicago
21         122   Mary  34.0      M          116.00   2024-01-22   Chicago

   Membership
6        Gold
8      Silver
10     Bronze
19        NaN
21        NaN

Total customers aged 30–40: 224

In [18]:
#Get all customers whose Membership is NOT Bronze.
not_bronze = df[df["Membership"] != "Bronze"]

print("Customers whose Membership is NOT Bronze:\n")
print(not_bronze.head())

print("\nTotal customers not Bronze:", not_bronze.shape[0])

Customers whose Membership is NOT Bronze:

   CustomerID    Name   Age Gender  PurchaseAmount PurchaseDate         City  \
0         101   Steve  58.0      F          374.05   2024-01-01  Los Angeles
1         102  Sophia  44.0      F          186.92   2024-01-02     New York
2         103   Linda  28.0      M          159.51   2024-01-03          NaN
3         104    Emma  58.0      M          224.81   2024-01-04        Miami
5         106    John  47.0      M          419.95   2024-01-06  Los Angeles

  Membership
0       Gold
1       Gold
2       Gold
3        NaN
5     Silver

Total customers not Bronze: 747

In [19]:
#Select all rows where PurchaseAmount > 200 AND Membership = 'Gold'.
gold_high_spenders = df[(df["PurchaseAmount"] > 200) & (df["Membership"] == "Gold")]

print("Customers with PurchaseAmount > 200 AND Membership = 'Gold':\n")
print(gold_high_spenders.head())

print("\nTotal matching customers:", gold_high_spenders.shape[0])

Customers with PurchaseAmount > 200 AND Membership = 'Gold':

    CustomerID    Name   Age Gender  PurchaseAmount PurchaseDate         City  \
0          101   Steve  58.0      F          374.05   2024-01-01  Los Angeles
7          108    Emma  44.0      F          377.25   2024-01-08      Houston
17         118   Linda  28.0      F          250.14   2024-01-18     New York
26         127  Daniel  33.0      F          393.07   2024-01-27  Los Angeles
42         143    Emma  27.0      F          266.28   2024-02-12      Chicago

   Membership
0        Gold
7        Gold
17       Gold
26       Gold
42       Gold

Total matching customers: 170

In [20]:
#Find customers in New York OR Chicago with Age < 35.
filtered_customers = df[
    (df["City"].isin(["New York", "Chicago"])) & 
    (df["Age"] < 35)
]

print("Customers in New York OR Chicago with Age < 35:\n")
print(filtered_customers.head())

print("\nTotal matching customers:", filtered_customers.shape[0])

Customers in New York OR Chicago with Age < 35:

    CustomerID   Name   Age Gender  PurchaseAmount PurchaseDate      City  \
6          107  Karen  30.0      M          143.86   2024-01-07  New York
17         118  Linda  28.0      F          250.14   2024-01-18  New York
21         122   Mary  34.0      M          116.00   2024-01-22   Chicago
29         130   Mary  28.0      M          228.05   2024-01-30   Chicago
42         143   Emma  27.0      F          266.28   2024-02-12   Chicago

   Membership
6        Gold
17       Gold
21        NaN
29     Silver
42       Gold

Total matching customers: 123

In [21]:
#Get all customers who do not have Membership info (NaN).
no_membership = df[df["Membership"].isna()]

print("Customers with missing Membership:\n")
print(no_membership.head())

print("\nTotal customers with missing Membership:", no_membership.shape[0])

Customers with missing Membership:

    CustomerID   Name   Age Gender  PurchaseAmount PurchaseDate     City  \
3          104   Emma  58.0      M          224.81   2024-01-04    Miami
11         112  Linda  20.0      F          193.35   2024-01-12      NaN
12         113  Karen  50.0      F          106.05   2024-01-13  Chicago
14         115  Karen  53.0      M          257.20   2024-01-15      NaN
19         120  David  37.0      F          436.94   2024-01-20  Chicago

   Membership
3         NaN
11        NaN
12        NaN
14        NaN
19        NaN

Total customers with missing Membership: 266

In [22]:
#Select top 3 customers with the highest PurchaseAmount.

top_3 = df.sort_values(by="PurchaseAmount", ascending=False).head(3)

print("Top 3 customers by PurchaseAmount:\n")
print(top_3)

print("\nShape:", top_3.shape)

Top 3 customers by PurchaseAmount:

     CustomerID   Name   Age Gender  PurchaseAmount PurchaseDate      City  \
428         529  David   NaN      M          499.06   2025-03-04  New York
215         316    Tom  59.0      F          498.66   2024-08-03       NaN
478         579   Emma  41.0      M          498.16   2025-04-23       NaN

    Membership
428       Gold
215        NaN
478       Gold

Shape: (3, 8)